{
    "list": [
        {
            "id": "1697296686208",
            "text": "Mock списка задач в виде JSON",
            "complete": false,
            "date": "01.12.2077"
        },
        {
            "id": "1697296686218",
            "text": "Модальное окно подтвержения удаления задачи",
            "complete": true,
            "date": "05.12.2077"
        },
        {
            "id": "1697296686228",
            "text": "Валидация даты по маске",
            "complete": false,
            "date": "02.12.2077"
        },
        {
            "id": "1697296686238",
            "text": "Модальное окно с формой добавления задачи",
            "complete": false,
            "date": "03.12.2077"
        },
        {
            "id": "1697296686248",
            "text": "Сделать поля текста задачи и даты обязательными",
            "complete": false,
            "date": "04.12.2077"
        },

        {
            "id": "1697296686258",
            "text": "Чекбокс для переключения статуса задачи",
            "complete": false,
            "date": "06.12.2077"
        },
        {
            "id": "1697296686268",
            "text": "Сортировка по дате",
            "complete": false,
            "date": "07.12.2077"
        },
        {
            "id": "1697296686278",
            "text": "Сортировка по тексту",
            "complete": false,
            "date": "08.12.2077"
        },
        {
            "id": "1697296686288",
            "text": "1) Сделать список зеброй\n2) Сделать шрифт даты моноширинным\n3) Подключить google font Exo\n4) Prettify and lint",
            "complete": false,
            "date": "09.12.2077"
        },
        {
            "id": "1697296686298",
            "text": "Хороший дирижер, передавая мысль композитора, делает сразу двадцать дел: читает партитуру, машет палочкой, следит за певцом, делает движение в сторону то барабана, то валторны и проч. То же самое и я, когда читаю. Предо мною полтораста лиц, не похожих одно на другое, и триста глаз, глядящих мне прямо в лицо. Цель моя – победить эту многоголовую гидру. Если я каждую минуту, пока читаю, имею ясное представление о степени ее внимания и о силе разумения, то она в моей власти. Другой мой противник сидит во мне самом. Это – бесконечное разнообразие форм, явлений и законов и множество ими обусловленных своих и чужих мыслей. Каждую минуту я должен иметь ловкость выхватывать из этого громадного материала самое важное и нужное и так же быстро, как течет моя речь, облекать свою мысль в такую форму, которая была бы доступна разумению гидры и возбуждала бы ее внимание, причем надо зорко следить, чтобы мысли передавались не по мере их накопления, а в известном порядке, необходимом для правильной компоновки картины, какую я хочу нарисовать. Далее я стараюсь, чтобы речь моя была литературна, определения кратки и точны, фраза возможно проста и красива. Каждую минуту я должен осаживать себя и помнить, что в моем распоряжении имеются только час и сорок минут. Одним словом, работы немало. В одно и то же время приходится изображать из себя и ученого, и педагога, и оратора, и плохо дело, если оратор победит в вас педагога и ученого, или наоборот.",
            "complete": false,
            "date": "09.12.2077"
        }
    ]
}
